# 03 - Konversi tipe data String ke Numerik pada kolom Data Frame

#Import Modules

Module yang digunakan :
1. pandas

In [16]:
import pandas as pd

-Mengecheck versi dari module pandas yang digunakan

In [17]:
print(pd.__version__)

1.0.5

#Membuat Pandas Data Frame dengan Menggunakan Dictionary dan List

Dictionary yang dibuat terdiri dari 2 pasangan keys (col1 dan col2) and values yang disimpan dalam sebuah varibel bernama "data". 

Keys yang dibuat nantinya akan menjadi nama dari kolom, sedangkan values yang dibuat akan mengisi data-data
pada kolom.

pd.DataFrame(data) akan membuat sebuah objek data frame bernama DataFrame yang datanya diambil dari variabel data.

In [18]:
data = {'col1' : ['1', '2', '3', 'teks'],
        'col2' : ['1', '2', '3', '4']}

df = pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

#Melihat tipe data yang terbentuk

col1 dan col2 akan bertipe data object karena data-data pada kolomnya berupa String.

In [19]:
df.dtypes

col1    object
col2    object
dtype: object

#Mengonversi tipe data dengan fungsi astype()

fungsi astype() dapat kita gunakan untuk mengonversi tipe data untuk 1 kolom.

-Berikut ini, kita akan mencoba mengonversi col2 menjadi bertipe data int.

In [20]:
df_x = df.astype({'col2' : 'int'})
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

-Melihat tipe data yang terbentuk setelah dikonversi

In [21]:
df_x.dtypes

col1    object
col2     int32
dtype: object

#Mengonversi tipe data numerik dengan fungsi to_numeric()

fungsi to_numeric() dapat kita gunakan untuk mengonversi tipe data untuk keseluruhan kolom.

df.apply(pd.to_numeric, error='coerce') berfungsi untuk menerapkan fungsi to_numeric() ke data frame. 

Selain itu, kita dapat membuat parameter errors bernilai 'coerce' untuk menggantikan data yang error ketika dikonversi menjadi NaN (Not a Number) sehingga dapat dieksekusi tanpa adanya error.

In [13]:
df.apply(pd.to_numeric, errors='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4